Can't rotate pinned element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotRotateLocked { get; }
  Visual Basic
Public Shared ReadOnly Property CannotRotateLocked As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotRotateLocked {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace